clc
clear
%要处理的类的名字
classlist=[201608003,201608007,201608009,201608018,201608033,201608034,201608035,201608037];
%要处理的频率
frequelist=[225,300,380,450,512];
%对应码率的名字 这边处理的是512码率的数据
%201608003
namelist(1,:)=[20181101150540,20181101151822,20181101161835,20181101162746,20181101163550];
%201608007
namelist(2,:)=[20181106132907,20181106133550,20181106134250,20181106135020,20181106135646];
%201608009
namelist(3,:)=[20181031134825,20181031135742,20181031140455,20181031141142,20181031141941];
%201608018
namelist(4,:)=[20181102150620,20181102152415,20181102153436,20181102154110,20181102154750];
%201608033
namelist(5,:)=[20181106151155,20181106151826,20181106152512,20181106153342,20181106154046];
%201608034
namelist(6,:)=[20181105160140,20181105161015,20181105161710,20181106082035,20181106082816];
%201608035
namelist(7,:)=[20181101174845,20181101175830,20181101191925,20181102091831,20181102093340];
%201608037
namelist(8,:)=[20181102110930,20181102134101,20181102134825,20181102135520,20181102140710];

% 能量检测阈值，实际观测信号功率均为一样

flag=5000;
    
for i=1:length(classlist)
    for ii=2:length(frequelist)  
        filein = [ './',num2str(classlist(i)),'/Fs3840000_Fc',num2str(frequelist(ii)*10^6)...
                 ,'_Bw2000000_IQ_',num2str(namelist(i,ii)), '.dat']          
        fid=fopen(filein,'rb');    %打开数据文件
        %进行能量检测
        data=fread(fid,'int16');
        dataI=data(1:2:end);
        clear data;
        win_wid=1000;
        j=1;
        start=1;
        while (start+win_wid-1)<=length(dataI)
            win=dataI(start:start+win_wid-1);
            eng=sum(win.^2)/win_wid;
            if eng>flag^2
                data_fin(j:j+win_wid-1)=win;
                j=j+win_wid;
            end
                start=start+win_wid;
        end
        j=1;
        start=1;
        fclose(fid);
        d = [ './',num2str(classlist(i)),'/Fs3840000_Fc',num2str(frequelist(ii)*10^6)...
                 ,'_Bw2000000_IQ_',num2str(namelist(i,ii)), '.mat'] 
        save(d,'data_fin');
        clear data_fin;
        
    end
end
    